04_OpenFoam/_ref/OpenFOAM-14/incompressibleFluid/waveSubSurface/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentViscosity];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    "(top|inlet|outlet)"
    {
        type            calculated;
        value           $internalField;
    }
    "(front|back)"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
